app/controllers/mapviewer_controller.rb

SELECT "points".* FROM "points"
---
   def index
    gon.points = Point.all